RT-Thread/rt-thread/bsp/at32/libraries/AT32F402_405_Firmware_Library/drivers/src/at32f402_405_spi.c
  switch(spi_i2s_flag)
  {
    case SPI_I2S_RDBF_FLAG:
      if(spi_x->sts_bit.rdbf && spi_x->ctrl2_bit.rdbfie)
      {
        status = SET;
      }
      break;
    case SPI_I2S_TDBE_FLAG:
      if(spi_x->sts_bit.tdbe && spi_x->ctrl2_bit.tdbeie)
      {
        status = SET;
      }
      break;
    case I2S_TUERR_FLAG:
      if(spi_x->sts_bit.tuerr && spi_x->ctrl2_bit.errie)
      {
        status = SET;
      }
      break;
    case SPI_CCERR_FLAG:
      if(spi_x->sts_bit.ccerr && spi_x->ctrl2_bit.errie)
      {
        status = SET;
      }
      break;
    case SPI_MMERR_FLAG:
      if(spi_x->sts_bit.mmerr && spi_x->ctrl2_bit.errie)
      {
        status = SET;
      }
      break;
    case SPI_I2S_ROERR_FLAG:
      if(spi_x->sts_bit.roerr && spi_x->ctrl2_bit.errie)
      {
        status = SET;
      }
      break;
    case SPI_I2S_CSPAS_FLAG:
      if(spi_x->sts_bit.cspas && spi_x->ctrl2_bit.errie)
      {
        status = SET;
      }
      break;
    default:
      break;
  };
  return status;
}

/**
  * @brief  clear flag of the specified spi/i2s peripheral.
  * @param  spi_x: select the spi/i2s peripheral.
  *         this parameter can be one of the following values:
  *         SPI1, SPI2, SPI3, I2SF5
  * @param  spi_i2s_flag: select the spi/i2s flag
  *         this parameter can be one of the following values:
  *         - SPI_CCERR_FLAG
  *         - SPI_I2S_RDBF_FLAG
  *         - I2S_TUERR_FLAG
  *         - SPI_MMERR_FLAG
  *         - SPI_I2S_ROERR_FLAG
  *         - SPI_I2S_CSPAS_FLAG
  * @note
  *         SPI_I2S_TDBE_FLAG  this flag is cleared when the tx buffer already contain data to be transmit.
  *         I2S_ACS_FLAG       this flag cann't cleared by software,the flag indicate the channel side(not use in pcm standard mode).
  *         SPI_I2S_BF_FLAG    this flag cann't cleared by software, it's set and cleared by hardware.
  * @retval none
  */
void spi_i2s_flag_clear(spi_type* spi_x, uint32_t spi_i2s_flag)
{
  if(spi_i2s_flag == SPI_CCERR_FLAG)
    spi_x->sts = ~SPI_CCERR_FLAG;
  else if(spi_i2s_flag == SPI_I2S_RDBF_FLAG)
    UNUSED(spi_x->dt);
  else if(spi_i2s_flag == I2S_TUERR_FLAG)
    UNUSED(spi_x->sts);
  else if(spi_i2s_flag == SPI_I2S_CSPAS_FLAG)
    UNUSED(spi_x->sts);
  else if(spi_i2s_flag == SPI_MMERR_FLAG)
  {
    UNUSED(spi_x->sts);
    spi_x->ctrl1 = spi_x->ctrl1;
  }
  else if(spi_i2s_flag == SPI_I2S_ROERR_FLAG)
  {
    UNUSED(spi_x->dt);
    UNUSED(spi_x->sts);
  }
}

/**
  * @brief  enable or disable the i2s fullduplex mode for the spi peripheral.
  * @param  spi_x: select the spi peripheral.
  *         this parameter can be one of the following values:
  *         I2SF5
  * @param  new_state: new state of i2s fullduplex mode.
  *         this parameter can be: TRUE or FALSE.
  * @retval none
  */
void i2sf_full_duplex_mode_enable(spi_type* spi_x, confirm_state new_state)
{
  spi_x->i2sctrl_bit.i2sfdupen = new_state;
}

/**
  * @brief  set the i2s pcm mode sample clock edge for the spi peripheral.
  * @param  spi_x: select the spi peripheral.
  *         this parameter can be one of the following values:
  *         I2SF5
  * @param  pcm_sample_clock: i2s pcm mode sample clock edge
  *         this parameter can be one of the following values:
  *         - I2S_PCM_SAMPLE_CLOCK_FALLING
  *         - I2S_PCM_SAMPLE_CLOCK_RISING
  * @retval none
  */
void i2sf_pcm_sample_clock_set(spi_type* spi_x, i2s_pcm_sample_clock_type pcm_sample_clock)
{
  spi_x->misc1_bit.i2sfpcmcksel = pcm_sample_clock;
}

/**
  * @}
  */

#endif

/**
  * @}
  */

/**
  * @}
  */
